Repository: Guilherme-Mandeli/price-from-sheet-woocommerce
Catalog: languages/price-from-sheet-woocommerce-*.po
Languages: pt_br

source: Price From Sheet
pt_br: Preço por Planilha

source: Import Prices
pt_br: Importar Preços

source: Spreadsheet File
pt_br: Arquivo da Planilha

source: Accepted formats: CSV (.csv), Excel (.xlsx, .xls) - Maximum: 10MB
pt_br: Formatos aceitos: CSV (.csv), Excel (.xlsx, .xls) - Máximo: 10MB

source: Update Mode
pt_br: Modo de Atualização

source: Update existing prices
pt_br: Atualizar preços existentes

source: Only add new prices
pt_br: Apenas adicionar novos preços

source: Import Now
pt_br: Importar Agora

source: Import Results
pt_br: Resultados da Importação

source: Complete Guide
pt_br: Guia Completo

source: Learn how to update your product prices in bulk.
pt_br: Aprenda a atualizar os preços dos produtos em massa.

source: What does the plugin do?
pt_br: O que o plugin faz?

source: This plugin allows you to update prices for hundreds or thousands of WooCommerce products at once, using CSV or Excel files. Instead of changing products one by one manually, you can do everything in just a few clicks!
pt_br: Este plugin permite atualizar os preços de centenas ou milhares de produtos WooCommerce de uma vez, usando arquivos CSV ou Excel. Em vez de alterar os produtos manualmente, você pode fazer tudo em apenas alguns cliques!

source: Update modes:
pt_br: Modos de atualização:

source: <strong>Update existing prices:</strong> will set the new value for all products listed in the file.
pt_br: <strong>Atualizar preços existentes:</strong> definirá o novo valor para todos os produtos listados no arquivo.

source: <strong>Only add new prices:</strong> will set the new value only for products without a defined price that are listed in the file.
pt_br: <strong>Apenas adicionar novos preços:</strong> definirá o novo valor apenas para produtos sem preço definido que estão listados no arquivo.

source: Preparing your spreadsheet
pt_br: Preparando sua planilha

source: Download Template | CSV
pt_br: Baixar Modelo | CSV

source: Download Template | Excel
pt_br: Baixar Modelo | Excel

source: Download a template file with the correct structure for import.
pt_br: Baixe um arquivo modelo com a estrutura correta para importação.

source: Required Format:
pt_br: Formato Requerido:

source: Complete Format (with sale price):
pt_br: Formato Completo (com preço promocional):

source: Important Rules:
pt_br: Regras Importantes:

source: <strong>SKU:</strong> Must be exactly the same as registered in WooCommerce
pt_br: <strong>SKU:</strong> Deve ser exatamente igual ao registrado no WooCommerce

source: <strong>Prices:</strong> Use dot (.) as decimal separator (e.g.: 29.90)
pt_br: <strong>Preços:</strong> Use ponto (.) como separador decimal (ex.: 29.90)

source: <strong>File:</strong> Save as CSV (comma separated) or Excel file respecting column names in the first row
pt_br: <strong>Arquivo:</strong> Salve como CSV (separado por vírgula) ou arquivo Excel respeitando os nomes das colunas na primeira linha

source: <strong>Encoding:</strong> UTF-8 to avoid accent problems
pt_br: <strong>Codificação:</strong> UTF-8 para evitar problemas com acentos

source: How to use
pt_br: Como usar

source: Choose the File
pt_br: Escolha o Arquivo

source: Click on "Choose file" and select your prepared CSV or Excel file.
pt_br: Clique em "Escolher arquivo" e selecione seu arquivo CSV ou Excel preparado.

source: Select Mode
pt_br: Selecione o Modo

source: Choose whether you want to "Update existing prices" or "Only add new prices".
pt_br: Escolha se deseja "Atualizar preços existentes" ou "Apenas adicionar novos preços".

source: Run the Import
pt_br: Executar a Importação

source: Click on "Import Now" and wait for the process.
pt_br: Clique em "Importar Agora" e aguarde o processo.

source: Troubleshooting common issues
pt_br: Resolvendo problemas comuns

source: "Product with SKU not found"
pt_br: "Produto com SKU não encontrado"

source: Cause:
pt_br: Causa:

source: The SKU in the spreadsheet does not exist in WooCommerce
pt_br: O SKU na planilha não existe no WooCommerce

source: Solution:
pt_br: Solução:

source: Check if the SKU is correct (no extra spaces)
pt_br: Verifique se o SKU está correto (sem espaços extras)

source: Confirm that the product exists in WooCommerce
pt_br: Confirme se o produto existe no WooCommerce

source: Make sure the SKU is not empty
pt_br: Certifique-se de que o SKU não está vazio

source: "Invalid row: SKU or price not found"
pt_br: "Linha inválida: SKU ou preço não encontrado"

source: Spreadsheet row is incomplete
pt_br: A linha da planilha está incompleta

source: Ensure all rows have SKU and price
pt_br: Certifique-se de que todas as linhas têm SKU e preço

source: Remove empty rows from the spreadsheet
pt_br: Remova linhas vazias da planilha

source: Confirm the headers are correct
pt_br: Confirme se os cabeçalhos estão corretos

source: Important Tips
pt_br: Dicas Importantes

source: Best Practices
pt_br: Melhores Práticas

source: <strong>Backup:</strong> Always make a backup before importing
pt_br: <strong>Backup:</strong> Sempre faça um backup antes de importar

source: <strong>Small test:</strong> Start with a few products to test
pt_br: <strong>Teste pequeno:</strong> Comece com alguns produtos para testar

source: <strong>Check SKUs:</strong> Confirm if the SKUs are correct
pt_br: <strong>Verifique os SKUs:</strong> Confirme se os SKUs estão corretos

source: <strong>Use UTF-8:</strong> To avoid accent problems
pt_br: <strong>Use UTF-8:</strong> Para evitar problemas com acentos

source: Cautions
pt_br: Atenções

source: <strong>Zero prices:</strong> Be careful not to put zero prices
pt_br: <strong>Preços zerados:</strong> Cuidado para não colocar preços zero

source: <strong>Comma in prices:</strong> Use dot (29.90) not comma (29,90)
pt_br: <strong>Vírgula nos preços:</strong> Use ponto (29.90) e não vírgula (29,90)

source: <strong>Duplicate SKUs:</strong> Each SKU must be unique
pt_br: <strong>SKUs duplicados:</strong> Cada SKU deve ser único

source: <strong>Variable products:</strong> Use the unique SKU of the variation product
pt_br: <strong>Produtos variáveis:</strong> Use o SKU único da variação do produto

source: Practical Example
pt_br: Exemplo Prático

source: Scenario: 10% price increase on 500 products
pt_br: Cenário: aumento de 10% no preço de 500 produtos

source: <strong>Export current products:</strong> Use WooCommerce > Products > Export
pt_br: <strong>Exportar produtos atuais:</strong> Use WooCommerce > Produtos > Exportar

source: <strong>Calculate new prices:</strong> Open in Excel/Google Sheets and create formula to increase 10%
pt_br: <strong>Calcular novos preços:</strong> Abra no Excel/Google Sheets e crie a fórmula para aumentar 10%

source: <strong>Import new prices:</strong> Save as CSV or Excel file with recommended columns and formats in "<i>Preparing your sheet</i>" and import using this plugin
pt_br: <strong>Importar novos preços:</strong> Salve como arquivo CSV ou Excel com as colunas e formatos recomendados em "<i>Preparando sua planilha</i>" e importe usando este plugin

source: Need Help?
pt_br: Precisa de Ajuda?

source: If you encounter problems:
pt_br: Se encontrar problemas:

source: 1. Check the logs in the results section above
pt_br: 1. Verifique os logs na seção de resultados acima

source: 2. Test with a few products first
pt_br: 2. Teste primeiro com alguns produtos

source: 3. Confirm the file format is correct
pt_br: 3. Confirme se o formato do arquivo está correto

source: 4. Contact: <strong>hooma.com.br</strong>
pt_br: 4. Contato: <strong>hooma.com.br</strong>

source: You do not have permission to perform this action.
pt_br: Você não tem permissão para realizar esta ação.

source: Access denied.
pt_br: Acesso negado.

source: File upload error.
pt_br: Erro ao enviar o arquivo.

source: File too large. Maximum allowed: 10MB. For larger files, use CSV.
pt_br: Arquivo muito grande. Máximo permitido: 10MB. Para arquivos maiores, use CSV.

source: Unsupported file format.
pt_br: Formato de arquivo não suportado.

source: Excel functionality temporarily unavailable. Use CSV as an alternative.
pt_br: Funcionalidade Excel temporariamente indisponível. Use CSV como alternativa.

source: Excel file is empty.
pt_br: O arquivo Excel está vazio.

source: Excel error: %s. Try converting to CSV.
pt_br: Erro no Excel: %s. Tente converter para CSV.

source: Line %s: SKU or price not found. Available columns: [%s]
pt_br: Linha %s: SKU ou preço não encontrado. Colunas disponíveis: [%s]

source: Line %s: SKU is empty. Price provided: "%s"
pt_br: Linha %s: SKU está vazio. Preço fornecido: "%s"

source: Line %s: Price is empty. SKU: "%s"
pt_br: Linha %s: Preço está vazio. SKU: "%s"

source: Line %s: Invalid price "%s". SKU: "%s" - Use only numbers with a dot or comma as the decimal separator
pt_br: Linha %s: Preço inválido "%s". SKU: "%s" - Use apenas números com ponto ou vírgula como separador decimal

source: Line %s: Product not found. SKU: "%s" – Check if the SKU exists in WooCommerce
pt_br: Linha %s: Produto não encontrado. SKU: "%s" – Verifique se o SKU existe no WooCommerce

source: Line %s: Error loading product. SKU: "%s" – Product may be corrupted
pt_br: Linha %s: Erro ao carregar o produto. SKU: "%s" – Produto pode estar corrompido

source: Line %s: Sale price (%s) must be lower than the regular price (%s). SKU: "%s"
pt_br: Linha %s: O preço promocional (%s) deve ser menor que o preço normal (%s). SKU: "%s"

source: Line %s: Invalid sale price "%s". SKU: "%s" – Use only numbers
pt_br: Linha %s: Preço promocional inválido "%s". SKU: "%s" – Use apenas números

source: Line %s: Error saving product. SKU: "%s" – Error: %s
pt_br: Linha %s: Erro ao salvar o produto. SKU: "%s" – Erro: %s

source: %d products successfully updated.
pt_br: %d produtos atualizados com sucesso.

source: Price From Sheet: PHPSpreadsheet could not be loaded. Check if the files are present in /vendor/phpoffice/.
pt_br: Price From Sheet: PHPSpreadsheet não pôde ser carregado. Verifique se os arquivos estão presentes em /vendor/phpoffice/.

source: WooCommerce Price From Sheet requires WooCommerce to work.
pt_br: O WooCommerce Price From Sheet requer o WooCommerce para funcionar.

source: Errors found:
pt_br: Erros encontrados:

source: Error communicating with the server.
pt_br: Erro na comunicação com o servidor.
